#include<stdio.h>
#include<math.h>

int main() {
    double x, y, r1, r2, T1, T2, W1, W2;
    //еденицы имзерения в СИ
    r1 = 3396000; //радиус орбиты Марса (м)
    r2 = 6371000; //радиус орбиты Земли (м)
    T1 = 59355072; //период обращения Марса вокруг Солнца (с)
    T2 = 31536000; //период обращения Земли вокруг Солнца (с)
    W1 = 2*M_PI/T1;
    W2 = 2*M_PI/T2;
    //
    for (int t = 0; t < 10; t++){
        x = ((r1 * cos(W1*t)) - (r2 * cos(W2*t)));
        y = ((r1 * sin(W1*t)) - (r2 * sin(W2*t)));
        printf("t=%d x=%.5lf y=%.5lf\n", t, x, y);
    }

    return 0;
}
